#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
	//TODO:ここで各自の初期化関数を呼び出してください
}

//--------------------------------------------------------------
void ofApp::update(){
	//TODO:ここではSequence処理をします
}

//--------------------------------------------------------------
void ofApp::draw(){
	//TODO:画面を初期化します
	//TODO:背景を出力します
	//TODO:ここはアニメーションを表示など背景以外を描写してください
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
